export class BulletModel {
  public readonly positions: number[] = [
    // Упрощенная сфера (8 вершин)
    0.0,
    0.1,
    0.0, // верх
    0.1,
    0.0,
    0.0, // право
    0.0,
    0.0,
    0.1, // перед
    -0.1,
    0.0,
    0.0, // лево
    0.0,
    0.0,
    -0.1, // зад
    0.0,
    -0.1,
    0.0, // низ
  ];

  public readonly colors: number[] = [
    // Желтый цвет для всех вершин
    1.0, 1.0, 0.0, 1.0, 1.0, 1.0, 0.0, 1.0, 1.0, 1.0, 0.0, 1.0, 1.0, 1.0, 0.0,
    1.0, 1.0, 1.0, 0.0, 1.0, 1.0, 1.0, 0.0, 1.0,
  ];

  public readonly indices: number[] = [
    0,
    1,
    2,
    0,
    2,
    3, // верхние треугольники
    0,
    3,
    4,
    0,
    4,
    1,
    5,
    2,
    1,
    5,
    3,
    2, // нижние треугольники
    5,
    4,
    3,
    5,
    1,
    4,
  ];
}
